# 用友医保科目映射字典 (名称 -> 编码)
# 建议在 transform_to_yonyou 逻辑中使用
import pandas as pd

# F6科目编码
income_dict_menzhen = {
    "挂号费": ("4101010101", "挂号收入"),
    "诊察费": ("4101010102", "诊察收入"),
    "检查费": ("4101010103", "检查收入"),
    "化验费": ("4101010104", "化验收入"),
    "治疗费": ("4101010105", "治疗收入"),
    "手术费": ("4101010106", "手术收入"),
    "卫生材料": ("4101010107", "卫生材料收入"),
    "药品收入": ("4101010108", "药品收入"),
    "西药费": ("410101010801", "西药"),
    "中成药费": ("410101010802", "中成药"),
    "中草药费": ("410101010803", "中草药"),
    "其它费": ("4101010110", "其他门诊收入"),
    "药事服务费": ("4101010109", "药事服务费收入"),
}

income_dict_menzhen1 = {
    # 121102010101 个人账户
    # 121102010102 统筹账户
    "个人统筹": ("121102010250", "个人统筹"),
    "哈尔滨铁路局": ("121102010243", "哈尔滨中铁局医保"),
    # 不确定
    "农垦": ("121102010248", "农垦结算医保"),
    "铁力市": ("121102010106", "铁力市门诊医保"),
    "异地": ("121102010236", "伊春外地区医保"),
    "现金": ("1001", "现金"),
}


income_dict_zhuyuan = {
    "床位费": ("4101010201", "床位收入"),
    "诊察费": ("4101010202", "诊察收入"),
    "检查费": ("4101010203", "检查收入"),
    "化验费": ("4101010204", "化验收入"),
    "治疗费": ("4101010205", "治疗收入"),
    "手术费": ("4101010206", "手术收入"),
    "护理费": ("4101010207", "护理收入"),
    "卫生材料": ("4101010208", "卫生材料收入"),
    "西药费": ("410101020901", "西药"),
    "中成药费": ("410101020902", "中成药费"),
    "饮片费": ("410101020903", "中草药"),
    "其它费": ("4101010211", "其他住院收入"),
}

# 铁力市
# 现金
# 农垦 结算方式
income_dict_common_code = {
    "个人统筹": ("121102010250", "个人统筹"),
    "铁力市": ("121102010245", "铁力市医保局结算医保"),
    "异地": ("121102010246", "伊春外地区结算医保"),
    "哈尔滨铁路局": ("121102010247", "哈尔滨中铁局结算医保"),
    "农垦": ("121102010248", "农垦结算医保"),
    "惠民宝": ("121102010249", "惠民宝"),
    "现金": ("1001", "库存现金"),
    # 新增惠民保
    "铁力市惠民保": ("12110201024901", "铁力惠民保"),
    "农垦惠民保": ("12110201024902", "农垦惠民保"),
    "哈尔滨铁路惠民保": ("12110201024903", "哈尔滨铁路惠民保"),
    "异地惠民保": ("12110201024904", "异地惠民保"),
}

advance_receipt_dict = {
    "2305": "预收账款",
    "230502": "住院预收款"
}

"""
缺少部门编码 cdept_id
"""
dept_code_dict = {
    "内二科门诊": "4",
    "神经心理科": "5",
    "口腔科": "5"
}

def get_dept_id(row):
    dept_name = "" if pd.isna(row["开单科室"]) else row["开单科室"]
    return dept_code_dict.get(dept_name, None)

def get_men_zhen_ccode(row, type):
    """
    门诊收入
    type 1 收款数据中的科目  2 汇总数据科目
    """
    if type == 1:
        config = income_dict_menzhen.get(row['项目'])
        if config:
            return config[0]
        # 其他门诊费用
        return "4101010110"
    else:
        if pd.isna(row['参保地']):
            # 现金
            return "1001"
        res = income_dict_common_code.get(row['参保地'])
        return res[0] if res else "1001"

def get_zhu_yuan_ccode(row):
    """
    住院收入
    """
    config = income_dict_zhuyuan.get(row['项目'])
    if config:
        return config[0]
    # 其他住院费用
    return "4101010211"

def get_zhu_yuan_ccode2(row):
    """
    构建住院结算数据
    """
    config = income_dict_common_code.get(row['内容'])
    if config:
        return config[0]
    # 其他住院费用
    return "1001"

income_dict_zhuyuan3 = {
    "挂号收入": ("4101010101", "挂号收入"),
    "床位收入": ("4101010201", "床位收入"),
    "诊察收入": ("4101010202", "诊察收入"),
    "检查收入": ("4101010203", "检查收入"),
    "化验收入": ("4101010204", "化验收入"),
    "治疗收入": ("4101010205", "治疗收入"),
    "手术收入": ("4101010206", "手术收入"),
    "护理收入": ("4101010207", "护理收入"),
    "卫生材料": ("4101010208", "卫生材料收入"),
    "西药收入": ("410101020901", "西药"),
    "中成药收入": ("410101020902", "中成药费"),
    "中草药收入": ("410101020903", "中草药"),
    "其它收入": ("4101010211", "其他住院收入"),
}
def get_zhu_yuan_ccode3(project):
    """
    全院病人费用
    """
    config = income_dict_zhuyuan3.get(project.strip())
    if config:
        return config[0]
    # 其他住院费用
    return "4101010211"

data_type = {
    "0": "门诊收入",
    "1": "住院结算",
    "2": "全院病人费用",
    "3": "门诊自助机",
    "4": "门诊扫码",
}

def get_jiesuan_ccode(name):
    """
    结算方式
    """
    config = income_dict_common_code.get(name.strip())
    if config:
        return config[0]
    return "100201"

def get_feiyong_menzhen_code(name):
    """
    门诊费用
    """
    config = income_dict_menzhen.get(name)
    if config:
        return config[0]
    # 其他门诊费用
    return "4101010110"

# is_build = False
is_build = True