# 用友医保科目映射字典 (名称 -> 编码)
# 建议在 transform_to_yonyou 逻辑中使用
import pandas as pd

yonyou_yibao_code_map = {
    "1211020102": "应收住院医保费",
    "121102010201": "公补支付",
    "121102010202": "统筹支付",
    "121102010203": "大额支付",
    "121102010204": "居民大病保险支付",
    "121102010205": "铁力市住院医保",
    "121102010206": "双丰住院医保",
    "121102010207": "桃山住院医保",
    "121102010208": "铁力局住院医保",
    "121102010209": "朗乡住院医保",
    "121102010210": "伊春市住院医保",
    "121102010211": "嘉荫住院医保",
    "121102010212": "伊春区住院医保",
    "121102010213": "乌马河住院医保",
    "121102010214": "南岔住院医保",
    "121102010215": "上甘玲住院医保",
    "121102010216": "美溪住院医保",
    "121102010217": "新青住院医保",
    "121102010218": "金山屯住院医保",
    "121102010219": "友好住院医保",
    "121102010220": "乌伊岭住院医保",
    "121102010221": "西林住院医保",
    "121102010222": "红星住院医保",
    "121102010223": "五营住院医保",
    "121102010224": "翠峦住院医保",
    "121102010225": "伊春外住院医保",
    "121102010226": "汤旺河住院医保",
    "121102010227": "金林区住院医保",
    "121102010228": "南岔县住院医保",
    "121102010229": "友好区住院医保",
    "121102010230": "丰林县住院医保",
    "121102010231": "伊美区住院医保",
    "121102010232": "汤旺县住院医保",
    "121102010233": "乌翠区住院医保",
    "121102010234": "大青山县住院医保",
    "121102010235": "大箐山县住院医保",
    "121102010236": "伊春外地区医保",
    "121102010237": "双城区住院医保",
    "121102010238": "农垦绥化分局医保",
    "121102010240": "医疗救助",
    "121102010242": "新冠住院",
    "121102010243": "哈尔滨中铁局医保",
    "121102010244": "华油医保",
    "1001": "库存现金",
}

# F6科目编码
income_dict_menzhen = {
    "4101": "事业收入",
    "410101": "医疗收入",
    "41010101": "门诊收入",
    "4101010101": "挂号收入",
    "4101010102": "诊察收入",
    "4101010103": "检查收入",
    "4101010104": "化验收入",
    "4101010105": "治疗收入",
    "4101010106": "手术收入",
    "4101010107": "卫生材料收入",
    "4101010108": "药品收入",
    "410101010801": "西药",
    "410101010802": "中成药",
    "410101010803": "中草药",
    "4101010110": "其他门诊收入"
}

income_dict_zhuyuan = {
    "41010102": "住院收入",
    "4101010201": "床位收入",
    "4101010202": "诊察收入",
    "4101010203": "检查收入",
    "4101010204": "化验收入",
    "4101010205": "治疗收入",
    "4101010206": "手术收入",
    "4101010207": "护理收入",
    "4101010208": "卫生材料收入",
    "4101010209": "药品收入",
    "410101020901": "西药",
    "410101020902": "中成药",
    "410101020903": "中草药",
    "4101010211": "其他住院收入"
}

advance_receipt_dict = {
    "2305": "预收账款",
    "230502": "住院预收款"
}

"""
缺少部门编码 cdept_id
"""
dept_code_dict = {
    "内二科门诊": "4",
    "内一科门诊": "5"
}

def get_dept_id(row):
    dept_name = "" if pd.isna(row["部门"]) else row["部门"]
    return dept_code_dict.get(dept_name, "")

def get_ccode(row, type):
    name = "" if pd.isna(row["费用名称"]) else row["费用名称"]
    name = name.replace("费", "")

    accout = "" if pd.isna(row["账号"]) else row["账号"]
    if name:
        # 有费用名称
        if type == 1:
            # 事业收入
            for i, (key, value) in enumerate(income_dict_menzhen.items()):
                if name in value:
                    return key
            return "41010101"
        elif type == 2:
            # 住院收入
            for i, (key, value) in enumerate(income_dict_zhuyuan.items()):
                if name in value:
                    return key
            return "41010102"
    else:
        # 账号 收款类型确定
        for i, (key, value) in enumerate(yonyou_yibao_code_map.items()):
            if accout in value:
                return key
        return "41010102"

